_src/wiki/2016-07-01-java-JavaCPP.org
# -*- coding: utf-8-unix; -*-
#+TITLE:       JavaCPP_技术使用经验总结
#+AUTHOR:      Bruce Asu
#+EMAIL:       bruceasu@163.com
#+DATE:        <2016-07-01 20:48>
#+filetags:    java c++ reprint
#+LANGUAGE:    en
#+OPTIONS:     H:7 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil

* JavaCPP 技术使用经验总结

本文是对 JNI 技术的一个补充方法，提出了替换 JNI、JNA 的一种开源技术。首先对
JavaCPP 技术进行简单介绍及对应于其他现有方案的介绍、对比。接下来，通过一个简单的
示例让大家了解 JavaCPP 的工作原理。然后，介绍了JavaCPP p resets 子项目，最后通过
若干个针对 presets 的示例来让大家了解如何使用它，本文主要提出了替换 JNI 的一种编
程实现方式。

周 明耀,
技术带头人、项目经理,
HikVision
2015 年 9 月 10 日


* JavaCPP 简介
JavaCPP 是一个开源库，它提供了在 Java 中高效访问本地 C++的方法。采用JNI技术实现，
所以支持所有 Java 实现包括 Android 系统，Avian 和 RoboVM。

- Android 一种基于 Linux 的自由及开放源代码的操作系统，主要使用于移动设备，如智
  能手机和平板电脑，由 Google 公司和开放手机联盟领导及开发。
- Avian Avian 是一个轻量级的 Java 虚拟机和类库，提供了 Java 特性的一个有用的子集，
  适合开发跨平台、自包容的应用程序。它实现非常快速而且体积小，主要特性包括如下四
  点：
- 类似于 HotSpot JVM 的 JIT 编译器，支持快速方法执行；
- 采用 JVM 的复制算法，即将现有的内存空间分为两快，每次只使用其中一块，在垃圾回
  收时将正在使用的内存中的存活对象复制到未被使用的内存块中，之后，清除正在使用的
  内存块中的所有对象，交换两个内存的角色，完成垃圾回收。这样可以确保内存回收过程
  中内存暂停服务的时间较短，并且内存的使用空间局限性较小；
- JVM 内存区域里面的本地栈快速分配，没有同步开销；
- 操作系统信号量方式解决了空指针问题，避免了不必要的分支。
- RoboVM RoboVM 编译器可以将 Java 字节码翻译成 ARM 或者 x86 平台上的原生代码，应
  用可直接在 CPU 上运行，无需其他解释器或者虚拟机。RoboVM 同时包含一个 Java 到
  Objective-C 的桥，可像其他 Java 对象一样来使用Objective-C 对象。

大多数 UIKit 已经支持，而且将会支持更多的框架。总的来说，JavaCPP 提供了一系列的
Annotation 将 Java 代码映射到 C++代码，并使用一个可执行的jar 包将 C++代码转化为
可以从 JVM 内调用的动态链接库文件。

与其他技术相比，特性总结如下表 1 所示。

表 1. 类似技术介绍或特点
#+BEGIN_EXPORT html
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
  <colgroup>
    <col  class="org-left" />

    <col  class="org-left" />
  </colgroup>
  <tbody>
    <tr>
      <td class="org-left">技术名称</td>
      <td class="org-left">技术介绍</td>
    </tr>


    <tr>
      <td class="org-left">CableSwig</td>
      <td class="org-left">用于针对 Tcl 和 Python 语言创建接口</td>
    </tr>


    <tr>
      <td class="org-left">JNIGeneratorApp</td>
      <td class="org-left">所有用于 SWT 的 C 代码都是通过它来创建的</td>
    </tr>


    <tr>
      <td class="org-left">cxxwrap</td>
      <td class="org-left">用于生成针对 C++的 Java JNI 包、HTML 文档、用户手册</td>
    </tr>


    <tr>
      <td class="org-left">JNIWrapper</td>
      <td class="org-left">商业版本，可以帮助实现 Java 和本地代码之间的无缝结合</td>
    </tr>


    <tr>
      <td class="org-left">Platform Invoke</td>
      <td class="org-left">微软发布的一个工具</td>
    </tr>


    <tr>
      <td class="org-left">GlueGen</td>
      <td class="org-left">针对 C 语言的一个工具，帮助生成 JNI 代码</td>
    </tr>


    <tr>
      <td class="org-left">LWJGL Generator</td>
      <td class="org-left">JNI 代码生成器</td>
    </tr>


    <tr>
      <td class="org-left">ctypes</td>
      <td class="org-left">针对 Python 的接口代码生成器</td>
    </tr>


    <tr>
      <td class="org-left">JNA</td>
      <td class="org-left">JNA（Java Native Access）提供一组 Java 工具类用于在运行期动态访问系统本地库（native library：如 Window 的 dll）而不需要编写任何 Native/JNI 代码。开发人员只要在一个 Java 接口中描述目标 native library 的函数与结构，JNA 将自动实现 Java 接口到 native function 的映射。</td>
    </tr>


    <tr>
      <td class="org-left">JNIEasy</td>
      <td class="org-left">替换 JNA 的一种技术</td>
    </tr>


    <tr>
      <td class="org-left">JNative</td>
      <td class="org-left">Windows 版本的库 (DLL)，提供了 JNI 代码生成</td>
    </tr>


    <tr>
      <td class="org-left">fficxx</td>
      <td class="org-left">针对 haskell 模型的代码生成器，主要生成 C 语言</td>
    </tr>


    <tr>
      <td class="org-left">JavaCPP</td>
      <td class="org-left">更加自然高效，它支持大部分的 C++语法特性。目前已经能成功封装 OpenCV, FFmpeg, libdc1394, PGR FlyCapture, OpenKinect, videoInput, and ARToolKitPlus。除此之外，它还能直接把 C/C++的头文件转化成 Java 类，能自动生成 JNI 代码，编译成本地库，开发人员无需编写繁琐的 C++、JNI 代码，从而提高开发效率。</td>
    </tr>
  </tbody>
</table>

#+END_EXPORT

