_src/wiki/2016-07-01-java-JavaCPP.org
* JavaCPP 示例

为了调用本地方法，JavaCPP 生成了对应的 JNI 代码，并且把这些代码输入到C++编译器，
用来构建本地库。使用了 Annotations 特性的 Java 代码在运行时会自动调用
Loader.load() 方法从 Java 资源里载入本地库，这里指的资源是工程构建过程中配置好的。

我们先来演示一个例子，这是一个简单的注入/读出方法，类似于 JavaBean 的工作方式。
清单 1 所示的 LegacyLibrary.h 包含了 C++类。

清单 1. LegacyLibrary.h
#+BEGIN_SRC cpp
#include <string>
namespace LegacyLibrary {
  class LegacyClass {
    public:
      const std::string& get_property() { return property; }
      void set_property(const std::string& property) { this->property = property; }
      std::string property;
  };
}

#+END_SRC

接下来定义一个 Java 类，驱动 JavaCPP 来完成调用 C++代码。

清单 2. LegacyLibrary.java
#+BEGIN_SRC java
import org.bytedeco.javacpp.*;
import org.bytedeco.javacpp.annotation.*;

@Platform(include="LegacyLibrary.h")
@Namespace("LegacyLibrary")
public class LegacyLibrary {
    public static class LegacyClass extends Pointer {
        static { Loader.load(); }
        public LegacyClass() { allocate(); }
        private native void allocate();

        // to call the getter and setter functions
        public native @StdString String get_property(); public native void set_property(String property);

        // to access the member variable directly
        public native @StdString String property(); public native void property(String property);
    }

    public static void main(String[] args) {
        // Pointer objects allocated in Java get deallocated once they become unreachable,
        // but C++ destructors can still be called in a timely fashion with Pointer.deallocate()
        LegacyClass l = new LegacyClass();
        l.set_property("Hello World!");
        System.out.println(l.property());
    }
}

#+END_SRC

以上两个类放在一个目录下面，接下来运行一系列编译指令，如清单 3 所示。

清单 3. 运行命令
#+BEGIN_VERSE
    $ javac -cp javacpp.jar LegacyLibrary.java
    $ java -jar javacpp.jar LegacyLibrary
    $ java -cp javacpp.jar LegacyLibrary

Hello World!

#+END_VERSE

我们看到清单 3 最后运行输出了一行“Hello World！”，这是 LegacyLibrary类里面定义好
的，通过一个 setter 方法注入字符串，getter 方法读出字符串。我们可以看到文件夹里
面内容的变化，刚开始的时候只有.h、.java两个文件，清单 3 所示的 3 个命令运行过后，
生成了 class 文件及本地方法 (native method) 对应的.so 文件。

清单 4. 文件夹内容变化
#+BEGIN_VERSE
    /home/zhoumingyao/javacpp-1.0-bin/javacpp-bin
    [root@node1:2 javacpp-bin]# ls -lrt
    总用量 348
    -rw-r--r-- 1 root root 30984 7 月 11 00:59 LICENSE.txt
    -rw-r--r-- 1 root root 21986 7 月 11 08:52 README.md
    -rw-r--r-- 1 root root 31955 7 月 11 08:53 CHANGELOG.md
    -rw-r--r-- 1 root root 243318 7 月 11 12:20 javacpp.jar
    -rw-r--r-- 1 root root 285 8 月 11 16:07 LegacyLibrary.h
    -rw-r--r-- 1 root root 1026 8 月 11 16:13 LegacyLibrary.java
    -rw-r--r-- 1 root root 643 8 月 11 16:13 LegacyLibrary$LegacyClass.class
    -rw-r--r-- 1 root root 794 8 月 11 16:13 LegacyLibrary.class
    drwxr-xr-x 2 root root 4096 8 月 11 16:13 linux-x86_64
    [root@node1:2 javacpp-bin]# ls -lrt linux-x86_64
    总用量 36
    -rwxr-xr-x 1 root root 35784 8 月 11 16:13 libjniLegacyLibrary.so回页首

#+END_VERSE
