wiki/2016-07-01-java-JavaCPP.html

<div id="outline-container-org4e2a4b7" class="outline-2">
<h2 id="org4e2a4b7">JavaCPP 示例</h2>
<div class="outline-text-2" id="text-org4e2a4b7">
<p>
为了调用本地方法，JavaCPP 生成了对应的 JNI 代码，并且把这些代码输入到C++编译器，
用来构建本地库。使用了 Annotations 特性的 Java 代码在运行时会自动调用
Loader.load() 方法从 Java 资源里载入本地库，这里指的资源是工程构建过程中配置好的。
</p>

<p>
我们先来演示一个例子，这是一个简单的注入/读出方法，类似于 JavaBean 的工作方式。
清单 1 所示的 LegacyLibrary.h 包含了 C++类。
</p>

<p>
清单 1. LegacyLibrary.h
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;string&gt;</span>
<span style="font-weight: bold;">namespace</span> <span style="font-weight: bold; text-decoration: underline;">LegacyLibrary</span> {
  <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">LegacyClass</span> {
    <span style="font-weight: bold;">public</span>:
      <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">string</span>&amp; <span style="font-weight: bold;">get_property</span>() { <span style="font-weight: bold;">return</span> property; }
      <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">set_property</span>(<span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">string</span>&amp; <span style="font-weight: bold; font-style: italic;">property</span>) { <span style="font-weight: bold;">this</span>-&gt;property = property; }
      <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">string</span> <span style="font-weight: bold; font-style: italic;">property</span>;
  };
}

</pre>
</div>

<p>
接下来定义一个 Java 类，驱动 JavaCPP 来完成调用 C++代码。
</p>

<p>
清单 2. LegacyLibrary.java
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">org</span>.<span style="font-weight: bold; text-decoration: underline;">bytedeco</span>.<span style="font-weight: bold; text-decoration: underline;">javacpp</span>.*;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">org</span>.<span style="font-weight: bold; text-decoration: underline;">bytedeco</span>.<span style="font-weight: bold; text-decoration: underline;">javacpp</span>.<span style="font-weight: bold; text-decoration: underline;">annotation</span>.*;

<span style="font-weight: bold; text-decoration: underline;">@Platform</span>(include=<span style="font-style: italic;">"LegacyLibrary.h"</span>)
<span style="font-weight: bold; text-decoration: underline;">@Namespace</span>(<span style="font-style: italic;">"LegacyLibrary"</span>)
<span style="font-weight: bold;">public</span> <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">LegacyLibrary</span> {
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">LegacyClass</span> <span style="font-weight: bold;">extends</span> <span style="font-weight: bold; text-decoration: underline;">Pointer</span> {
        <span style="font-weight: bold;">static</span> { Loader.load(); }
        <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">LegacyClass</span>() { allocate(); }
        <span style="font-weight: bold;">private</span> <span style="font-weight: bold;">native</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">allocate</span>();

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">to call the getter and setter functions</span>
        <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">native</span> <span style="font-weight: bold; text-decoration: underline;">@StdString</span> <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold;">get_property</span>(); <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">native</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">set_property</span>(<span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">property</span>);

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">to access the member variable directly</span>
        <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">native</span> <span style="font-weight: bold; text-decoration: underline;">@StdString</span> <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold;">property</span>(); <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">native</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">property</span>(<span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">property</span>);
    }

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">String</span>[] <span style="font-weight: bold; font-style: italic;">args</span>) {
        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Pointer objects allocated in Java get deallocated once they become unreachable,</span>
        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">but C++ destructors can still be called in a timely fashion with Pointer.deallocate()</span>
        <span style="font-weight: bold; text-decoration: underline;">LegacyClass</span> <span style="font-weight: bold; font-style: italic;">l</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">LegacyClass</span>();
        l.set_property(<span style="font-style: italic;">"Hello World!"</span>);
        System.out.println(l.property());
    }
}

</pre>
</div>

<p>
以上两个类放在一个目录下面，接下来运行一系列编译指令，如清单 3 所示。
</p>

<p>
清单 3. 运行命令
</p>
<p class="verse">
&#xa0;&#xa0;&#xa0;&#xa0;$ javac -cp javacpp.jar LegacyLibrary.java<br>
&#xa0;&#xa0;&#xa0;&#xa0;$ java -jar javacpp.jar LegacyLibrary<br>
&#xa0;&#xa0;&#xa0;&#xa0;$ java -cp javacpp.jar LegacyLibrary<br>
<br>
Hello World!<br>
<br>
</p>

<p>
我们看到清单 3 最后运行输出了一行“Hello World！”，这是 LegacyLibrary类里面定义好
的，通过一个 setter 方法注入字符串，getter 方法读出字符串。我们可以看到文件夹里
面内容的变化，刚开始的时候只有.h、.java两个文件，清单 3 所示的 3 个命令运行过后，
生成了 class 文件及本地方法 (native method) 对应的.so 文件。
</p>

<p>
清单 4. 文件夹内容变化
</p>
<p class="verse">
/home/zhoumingyao/javacpp-1.0-bin/javacpp-bin<br>
[root@node1:2 javacpp-bin]# ls -lrt<br>
总用量 348<br>
-rw-r--r-- 1 root root 30984 7 月 11 00:59 LICENSE.txt<br>
-rw-r--r-- 1 root root 21986 7 月 11 08:52 README.md<br>
-rw-r--r-- 1 root root 31955 7 月 11 08:53 CHANGELOG.md<br>
-rw-r--r-- 1 root root 243318 7 月 11 12:20 javacpp.jar<br>
-rw-r--r-- 1 root root 285 8 月 11 16:07 LegacyLibrary.h<br>
-rw-r--r-- 1 root root 1026 8 月 11 16:13 LegacyLibrary.java<br>
-rw-r--r-- 1 root root 643 8 月 11 16:13 LegacyLibrary$LegacyClass.class<br>
-rw-r--r-- 1 root root 794 8 月 11 16:13 LegacyLibrary.class<br>
drwxr-xr-x 2 root root 4096 8 月 11 16:13 linux-x86_64<br>
[root@node1:2 javacpp-bin]# ls -lrt linux-x86_64<br>
总用量 36<br>
-rwxr-xr-x 1 root root 35784 8 月 11 16:13 libjniLegacyLibrary.so回页首<br>
<br>
</p>
</div>
</div>
