_src/wiki/2016-07-01-java-JavaCPP.org
* JavaCPP-Presents 简介

为了方便用户使用 JavaCPP，该项目下属有一个 presets 项目，它将一些常用的项目，例
如 OpenCV、FFMpeg 等，都编译好了让用户通过调用 Jar 包的方式直接使用。当然，它也
允许用户通过简便的方式上传自己做的本地库文件，通过将 jar 包上传到 Maven 仓库的方
式共享给其他用户。如果我们想要使用JavaCPP-presents，我们需要下载 presets 源代码
或者已经编译好的 jar 文件。

具体下载地址：<https://github.com/bytedeco/javacpp-presets>。
编译好的 jar 文件有很多，主要是 JavaCPP 支持的项目，如图 1 所示。

图 1. JavaCPP-presents binary 目录

JavaCPP Presets 模型包括了很多广泛被使用到的 C/C++类库的 Java 配置和接口类。编译
器结合 C/C++的头文件，使用 org.bytedeco.javacpp.presets 包里面的配置文件来创建
Java 接口文件，这样就可以产生类似于 JNI 的库，Java程序可以调用底层的 C/C++库。它
的机制较为方便，可以被用在 Java 平台、Android平台。

这个项目提供了两种下载方式，一种是集成了常用库的 jar 包，支持 Android、L inux
Fedora、Mac OS X、Windows 等操作系统，另一种是该项目的源代码，您可以自己编译适用
于自己开发环境的 jar 包，当然如果您希望针对自己的c++工程制作 jar 包，可以采用其
他方式。

如果下载的是 JavaCPP-presets 源代码包，则 Centos 环境（该环境默认不被支持）需要
安装 JDK、Maven、GCC，这样才能编译项目成为需要的 Jar 包。

配置 Maven 的方式如清单 5 所示。

清单 5. Linux 上配置 Maven
1. 下载 Maven 并上传到服务器，这里上传到了/root 目录下面；
2. vi /etc/profile
   在最后两行加上代码：
   : export MAVEN_HOME=/root/apache-maven-3.1.1
   : export PATH=${MAVEN_HOME}/bin:${PATH}
3. source /etc/profile
4. [root@node1:2 bin]# mvn -v
   #+BEGIN_VERSE
    Apache Maven 3.1.1 (0728685237757ffbf44136acec0402957f723d9a; 2013-09-17 23:22:22+0800)
    Maven home: /root/apache-maven-3.1.1
    Java version: 1.8.0_45, vendor: Oracle Corporation
    Java home: /usr/share/jdk1.8.0_45/jre
    Default locale: zh_CN, platform encoding: UTF-8
    OS name: "linux", version: "2.6.32-504.el6.x86_64", arch: "amd64", family: "unix"

   #+END_VERSE

如果您想要尝试完全动手编译 presets 项目，那您可以在 Maven 的 pom.xml文件里面配置，
如清单 6 所示，这样您可以下载到所有需要的代码。

清单 6. 下载全部代码
#+BEGIN_SRC xml
    <dependency>
     <groupId>org.bytedeco.javacpp-presets</groupId>
     <artifactId>${moduleName}</artifactId>
     <version>${moduleVersion}-1.0</version>
    </dependency>

#+END_SRC

JavaCPP-Presents 已经默认包含了一些开源库，例如 OpenCV、FFmpeg、FlyCapt ure、GSL、
CUDA、Tesseract 等等，我们可以通过运行 Maven 命令来编译、构建.so 文件和 jar 文件，
命令是$ mvn install &#x2013;projects .,opencv,ffmpeg,fly
capture,libdc1394,libfreenect,videoinput,artoolkitplus,etc.如清单 7 所示，我们编
译 ffmpeg 库，我这里只截取小部分的打印输出，都是到 Maven 仓库下载 jar 包的过程输
出。

清单 7. 编译 ffmpeg 库
#+BEGIN_VERSE
    [root@localhost javacpp-presets]# mvn install --projects ffmpeg
    [INFO] Scanning for projects...
    Downloading: http://repo.maven.apache.org/maven2/org/sonatype/plugins/
                    nexus-staging-maven-plugin/1.6/nexus-staging-maven-plugin-1.6.pom
    Downloaded: http://repo.maven.apache.org/maven2/org/sonatype/plugins/
                    nexus-staging-maven-plugin/1.6/nexus-staging-maven-plugin-1.6.pom (12 KB at 0.7 KB/sec)
    Downloading: http://repo.maven.apache.org/maven2/org/sonatype/
                    nexus/maven/nexus-staging/1.6/nexus-staging-1.6.pom
    Downloaded: http://repo.maven.apache.org/maven2/org/sonatype/
                    nexus/maven/nexus-staging/1.6/nexus-staging-1.6.pom (3 KB at 3.8 KB/sec)
    Downloading: http://repo.maven.apache.org/maven2/org/sonatype/
                    nexus/maven/nexus-maven-plugins/1.6/nexus-maven-plugins-1.6.pom
    Downloaded: http://repo.maven.apache.org/maven2/org/sonatype/
                    nexus/maven/nexus-maven-plugins/1.6/nexus-maven-plugins-1.6.pom (17 KB at 7.8 KB/sec)
    Downloading: http://repo.maven.apache.org/maven2/org/sonatype/
                    buildsupport/public-parent/5/public-parent-5.pom

#+END_VERSE

