_src/wiki/2016-07-01-java-JavaCPP.org
* JavaCPP-Presents 示例

讲解程序前，我们先来了解一下 cppbuild.sh 这个文件，这个脚本在根目录下面，它主要
功能是被用来构建和创建本地 C++库。例如清单 8 所示，我们编译ffmpeg 库，

清单 8. 编译 ffmpeg 库

: ./cppbuild.sh -platform linux-x86_64 install ffmpeg

脚本的第一个参数是-platform，值是 linux-x86<sub>64</sub> 判断代码如清单 9 所示，
如果第一个参数是-platform，那么初始化变量 PLATFORM，然后参数位移动一位到第二个参
数，如果第二个参数是 install，那么初始化变量 OPERATION 为install，如果第二个参数
是 clean，初始化变量 OPERATION 为 clean。这里是install。

清单 9. 判断平台
#+BEGIN_SRC bash
    while [[ $# > 0 ]]; do
     case "$1" in
     -platform)
     shift
     PLATFORM="$1"
     ;;
     install)
     OPERATION=install
     ;;
     clean)
     OPERATION=clean
     ;;
     *)
     PROJECTS+=("$1")
     ;;
     esac
     shift
    done

#+END_SRC

确定了需要 install 操作后，程序进入实际执行阶段，如清单 10 所示。

清单 10. install 执行阶段
#+BEGIN_SRC bash
    case $OPERATION in
     install)
     if [[ ! -d $PROJECT ]]; then
     echo "Warning: Project \"$PROJECT\" not found"
     else
     echo "Installing \"$PROJECT\""
     mkdir -p $PROJECT/cppbuild
     pushd $PROJECT/cppbuild
     source ../cppbuild.sh
     popd
     fi

#+END_SRC

清单 10 所示代码，创建 ffmpeg/cpubuild 目录，接下来将目录压入目录栈，在当前 bash
环境下读取并执行 ffmpeg 目录下的 cpubuild.sh 中的命令，最后将目录弹出目录栈。从
这里可以看出，真实执行的是 ffmpeg 目录下面的cpubuild.s h 命令，它的代码在这里不
做展开，主要执行的是一连串的 make命令，编译 C++代码、生成.so 文件。

示例程序 1：自己写一个简单的 FFmpeg 库

我们这里所举例的例子是一个调用 FFmpeg 多媒体库的示例。FFmpeg 是一套可以用来记录、
转换数字音频、视频，并能将其转化为流的开源计算机程序。采用LG PL 或 GPL 许可证。
它提供了录制、转换以及流化音视频的完整解决方案。

如果想要下载 FFmpeg 源代码或者库文件，可以在这里查找：<http://ffmpeg.org/>。

如果想要查看 FFmpeg 的 API，可以在这里查找：
<http://bytedeco.org/javacpp-presets/ffmpeg/apidocs/>。

运行整个程序，我们需要三个文件，大家把这三个文件放在同一个目录下面。首先是 C 的
源代码，这里只引用一小部分，剩余的可以到 github 上看，作者是 Stephen Dranger。

清单 11. C 源代码
#+BEGIN_SRC C
    //
    // This tutorial was written by Stephen Dranger (dranger@gmail.com).
    //
    // Code based on a tutorial by Martin Bohme (boehme@inb.uni-luebeckREMOVETHIS.de)
    // Tested on Gentoo, CVS version 5/01/07 compiled with GCC 4.1.1

    // A small sample program that shows how to use libavformat and libavcodec to
    // read video from a file.
    //
    // Use the Makefile to build all examples.
    //
    // Run using
    //
    // tutorial01 myvideofile.mpg
    //
    // to write the first five frames from "myvideofile.mpg" to disk in PPM
    // format.

    #include <libavcodec/avcodec.h>
    #include <libavformat/avformat.h>
    #include <libswscale/swscale.h>

    #include <stdio.h>

    void SaveFrame(AVFrame *pFrame, int width, int height, int iFrame) {
    FILE *pFile;
    char szFilename[32];
    int y;

    // Open file
    sprintf(szFilename, "frame%d.ppm", iFrame);
    pFile=fopen(szFilename, "wb");
    if(pFile==NULL)
    return;

    // Write header
    fprintf(pFile, "P6\n%d %d\n255\n", width, height);

    // Write pixel data
    for(y=0; y<height; y++)
    fwrite(pFrame->data[0]+y*pFrame->linesize[0], 1, width*3, pFile);

    // Close file
    fclose(pFile);
    }

    int main(int argc, char *argv[]) {
    AVFormatContext *pFormatCtx = NULL;
    int i, videoStream;
    AVCodecContext *pCodecCtx = NULL;
    AVCodec *pCodec = NULL;
    AVFrame *pFrame = NULL;
    AVFrame *pFrameRGB = NULL;
    AVPacket packet;
    int frameFinished;
    int numBytes;
    uint8_t *buffer = NULL;

    AVDictionary *optionsDict = NULL;
    struct SwsContext *sws_ctx = NULL;

#+END_SRC

接下来，需要创建一个 pom.xml 文件，这样可以利用 Maven 仓库下载我们需要的FFmpeg
 库文件。pom.xml 文件内容如清单 12 所示。

清单 12. pom.xml 文件
#+BEGIN_SRC xml
    <project>
     <modelVersion>4.0.0</modelVersion>
     <groupId>org.bytedeco.javacpp-presets.ffmpeg</groupId>
     <artifactId>tutorial01</artifactId>
     <version>1.0</version>
     <dependencies>
     <dependency>
     <groupId>org.bytedeco.javacpp-presets</groupId>
     <artifactId>ffmpeg</artifactId>
     <version>2.7.1-1.0</version>
     </dependency>
     </dependencies>
    </project>

#+END_SRC

最后是 Java 代码的实现，在这个 Java 代码里面，它会调用 FFmpeg 的库函数进行针对视
频的转换，如清单 13 所示。

清单 13. Java 文件源代码
#+BEGIN_SRC java
import java.io.*;
import org.bytedeco.javacpp.*;
import static org.bytedeco.javacpp.avcodec.*;
import static org.bytedeco.javacpp.avformat.*;
import static org.bytedeco.javacpp.avutil.*;
import static org.bytedeco.javacpp.swscale.*;

public class testJavaCPP {
    static void SaveFrame(AVFrame pFrame, int width, int height, int iFrame)
        throws IOException {
        // Open file
        OutputStream stream = new FileOutputStream("frame" + iFrame + ".ppm");

        // Write header
        stream.write(("P6\n" + width + " " + height + "\n255\n").getBytes());

        // Write pixel data
        BytePointer data = pFrame.data(0);
        byte[] bytes = new byte[width * 3];
        int l = pFrame.linesize(0);
        for(int y = 0; y < height; y++) {
            data.position(y * l).get(bytes);
            stream.write(bytes);
        }

        // Close file
        stream.close();
    }

    public static void main(String[] args) throws IOException {
        AVFormatContext pFormatCtx = new AVFormatContext(null);
        int i, videoStream;
        AVCodecContext pCodecCtx = null;
        AVCodec pCodec = null;
        AVFrame pFrame = null;
        AVFrame pFrameRGB = null;
        AVPacket packet = new AVPacket();
        int[] frameFinished = new int[1];
        int numBytes;
        BytePointer buffer = null;

        AVDictionary optionsDict = null;
        SwsContext sws_ctx = null;

        if (args.length < 1) {
            System.out.println("Please provide a movie file");
            System.exit(-1);
        }
        // Register all formats and codecs
        av_register_all();

        // Open video file
        if (avformat_open_input(pFormatCtx, args[0], null, null) != 0) {
            System.exit(-1); // Couldn't open file
        }

        // Retrieve stream information
        if (avformat_find_stream_info(pFormatCtx, (PointerPointer)null) < 0) {
            System.exit(-1); // Couldn't find stream information
        }

        // Dump information about file onto standard error
        av_dump_format(pFormatCtx, 0, args[0], 0);

        // Find the first video stream
        videoStream = -1;
        for (i = 0; i < pFormatCtx.nb_streams(); i++) {
            if (pFormatCtx.streams(i).codec().codec_type() == AVMEDIA_TYPE_VIDEO) {
                videoStream = i;
                break;
            }
        }
        if (videoStream == -1) {
            System.exit(-1); // Didn't find a video stream
        }

        // Get a pointer to the codec context for the video stream
        pCodecCtx = pFormatCtx.streams(videoStream).codec();

        // Find the decoder for the video stream
        pCodec = avcodec_find_decoder(pCodecCtx.codec_id());
        if (pCodec == null) {
            System.err.println("Unsupported codec!");
            System.exit(-1); // Codec not found
        }
        // Open codec
        if (avcodec_open2(pCodecCtx, pCodec, optionsDict) < 0) {
            System.exit(-1); // Could not open codec
        }

        // Allocate video frame
        pFrame = av_frame_alloc();

        // Allocate an AVFrame structure
        pFrameRGB = av_frame_alloc();
        if(pFrameRGB == null) {
            System.exit(-1);
        }

        // Determine required buffer size and allocate buffer
        numBytes = avpicture_get_size(AV_PIX_FMT_RGB24,
                                      pCodecCtx.width(), pCodecCtx.height());
        buffer = new BytePointer(av_malloc(numBytes));

        sws_ctx = sws_getContext(pCodecCtx.width(), pCodecCtx.height(),
                                 pCodecCtx.pix_fmt(), pCodecCtx.width(), pCodecCtx.height(),
                                 AV_PIX_FMT_RGB24, SWS_BILINEAR, null, null, (DoublePointer)null);

        // Assign appropriate parts of buffer to image planes in pFrameRGB
        // Note that pFrameRGB is an AVFrame, but AVFrame is a superset
        // of AVPicture
        avpicture_fill(new AVPicture(pFrameRGB), buffer, AV_PIX_FMT_RGB24,
                       pCodecCtx.width(), pCodecCtx.height());

        // Read frames and save first five frames to disk
        i = 0;
        while (av_read_frame(pFormatCtx, packet) >= 0) {
            // Is this a packet from the video stream?
            if (packet.stream_index() == videoStream) {
                // Decode video frame
                avcodec_decode_video2(pCodecCtx, pFrame, frameFinished, packet);

                // Did we get a video frame?
                if (frameFinished[0] != 0) {
                    // Convert the image from its native format to RGB
                    sws_scale(sws_ctx, pFrame.data(), pFrame.linesize(), 0,
                              pCodecCtx.height(), pFrameRGB.data(), pFrameRGB.linesize());

                    // Save the frame to disk
                    if (++i<=5) {
                        SaveFrame(pFrameRGB, pCodecCtx.width(), pCodecCtx.height(), i);
                    }
                }
            }

            // Free the packet that was allocated by av_read_frame
            av_free_packet(packet);
        }

        // Free the RGB image
        av_free(buffer);
        av_free(pFrameRGB);

        // Free the YUV frame
        av_free(pFrame);

        // Close the codec
        avcodec_close(pCodecCtx);

        // Close the video file
        avformat_close_input(pFormatCtx);

        System.exit(0);
    }

#+END_SRC

所需要的文件创建完毕以后，可以通过 maven 命令来编译、执行程序，如清单 14 所示。

清单 14. 运行命令

: mvn package exec:java -Dexec.mainClass=testJavaCPP -Dexec.args="您的视频文件"

示例程序 2：加入一个新的库

从清单 10 我们知道，最终调用的是自己 C++代码文件夹里面的 cppbuild.sh文件，所以我
们如果想要增加一个新的库，势必也需要创建该文件。总的来说，我们需要注意三点：

1. 创建一个全部小写字母组成的文件夹，这个文件夹的名称和最终生成的JAR 包的文件名，
   以及 Maven 的 attifact 名称会完全一致，例如 test c++；
2. 在这个文件夹下，创建新的工程，这个工程需要包括 cppbuild.sh 文件和pom.xml 文件，
   以及属于 org.bytedeco.javacpp.presets 包的 Java 的配置文件；
3. 上述 2 步到位后，发起一个请求，编译自己的代码，然后上传二进制库文件到 Maven
   中央仓库，这样其他用户也可以调用您的库实现本地方法操作了。 我们以
   java.util.zip 包为例，里面包含了一个 zlib 库，首先需要创建 cppbuild.s h，代码
   里面需要下载 zlib 源代码，如清单 15 所示。

清单 15. zlib 的 cppbuild.sh 文件源代码
#+BEGIN_SRC bash
    #!/bin/bash
    # This file is meant to be included by the parent cppbuild.sh script
    if [[ -z "$PLATFORM" ]]; then
     pushd ..
     bash cppbuild.sh "$@" zlib
     popd
     exit
    fi

    if [[ $PLATFORM == windows* ]]; then
     ZLIB_VERSION=128
     download http://zlib.net/zlib$ZLIB_VERSION-dll.zip zlib$ZLIB_VERSION-dll.zip
     mkdir -p $PLATFORM
     cd $PLATFORM
     unzip ../zlib$ZLIB_VERSION-dll.zip -d zlib$ZLIB_VERSION-dll
     cd zlib$ZLIB_VERSION-dll
    else
     ZLIB_VERSION=1.2.8
     download http://zlib.net/zlib-$ZLIB_VERSION.tar.gz zlib-$ZLIB_VERSION.tar.gz
     mkdir -p $PLATFORM
     cd $PLATFORM
     tar -xzvf ../zlib-$ZLIB_VERSION.tar.gz
     cd zlib-$ZLIB_VERSION
    fi

    case $PLATFORM in
     linux-x86)
     CC="gcc -m32 -fPIC" ./configure --prefix=.. --static
     make -j4
     make install
     ;;
     *)
     echo "Error: Platform \"$PLATFORM\" is not supported"
     ;;
    esac

    cd ../..
#+END_SRC

pom.xml 如清单 16 所示，最终生成 zlib 的 jar 包。

清单 16. zlib 的 pom.xml 源代码
#+BEGIN_SRC xml
    <?xml version="1.0" encoding="UTF-8"?>
    <project xmlns="http://maven.apache.org/POM/4.0.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
     xsi:schemaLocation="http://maven.apache.org/POM/4.0.0 http://maven.apache.org/maven-v4_0_0.xsd">
     <modelVersion>4.0.0</modelVersion>

     <parent>
     <groupId>org.bytedeco</groupId>
     <artifactId>javacpp-presets</artifactId>
     <version>0.10</version>
     </parent>

     <groupId>org.bytedeco.javacpp-presets</groupId>
     <artifactId>zlib</artifactId>
     <version>1.2.8-${project.parent.version}</version>
     <packaging>jar</packaging>
     <name>JavaCPP Presets for zlib</name>

     <dependencies>
     <dependency>
     <groupId>org.bytedeco</groupId>
     <artifactId>javacpp</artifactId>
     </dependency>
     </dependencies>

     <build>
     <plugins>
     <plugin>
     <artifactId>maven-resources-plugin</artifactId>
     </plugin>
     <plugin>
     <artifactId>maven-compiler-plugin</artifactId>
     </plugin>
     <plugin>
     <groupId>org.bytedeco</groupId>
     <artifactId>javacpp</artifactId>
     </plugin>
     <plugin>
     <artifactId>maven-jar-plugin</artifactId>
     </plugin>
     <plugin>
     <artifactId>maven-dependency-plugin</artifactId>
     </plugin>
     <plugin>
     <artifactId>maven-source-plugin</artifactId>
     </plugin>
     <plugin>
     <artifactId>maven-javadoc-plugin</artifactId>
     </plugin>
     </plugins>
     </build>

    </project>

#+END_SRC

清单 17 所示是 Java 配置文件，文件需要被放在
src/main/java/org/bytedeco/javacpp/presets 目录下面。

清单 17. zlib 的 Java 源代码
#+BEGIN_SRC java
    package org.bytedeco.javacpp.presets;

    import org.bytedeco.javacpp.annotation.*;
    import org.bytedeco.javacpp.tools.*;

    @Properties(target="org.bytedeco.javacpp.zlib", value={
                                     @Platform(include="<zlib.h>", link="z@.1"),
     @Platform(value="windows", link="zdll", preload="zlib1")})
    public class zlib implements InfoMapper {
     public void map(InfoMap infoMap) {
     infoMap.put(new Info("ZEXTERN", "ZEXPORT", "z_const", "zlib_version").cppTypes().annotations())
     .put(new Info("FAR").cppText("#define FAR"))
     .put(new Info("OF").cppText("#define OF(args) args"))
     .put(new Info("Z_ARG").cppText("#define Z_ARG(args) args"))
     .put(new Info("Byte", "Bytef", "charf").cast().valueTypes("byte").pointerTypes("BytePointer"))
     .put(new Info("uInt", "uIntf").cast().valueTypes("int").pointerTypes("IntPointer"))
     .put(new Info("uLong", "uLongf", "z_crc_t", "z_off_t").cast().valueTypes(
                                        "long").pointerTypes("CLongPointer"))
     .put(new Info("z_off64_t").cast().valueTypes("long").pointerTypes("LongPointer"))
     .put(new Info("voidp", "voidpc", "voidpf").valueTypes("Pointer"))
     .put(new Info("gzFile_s").pointerTypes("gzFile"))
     .put(new Info("gzFile").valueTypes("gzFile"))
     .put(new Info("Z_LARGE64", "!defined(ZLIB_INTERNAL) && defined(Z_WANT64)").define(false))
     .put(new Info("inflateGetDictionary", "gzopen_w", "gzvprintf").skip());
     }
    }

#+END_SRC

在我们的父目录 javacpp-presets 里面，我们需要把 zlib 这个模块的名称加入到
pom.xml 的模块列表里面，这样我们就可以像前面示例代码一样运行程序来生成.so 包和
jar 包，mvn install –projects zlib。

