wiki/2016-07-01-java-JavaCPP.html

<div id="outline-container-org28ebe44" class="outline-2">
<h2 id="org28ebe44">JavaCPP-Presents 示例</h2>
<div class="outline-text-2" id="text-org28ebe44">
<p>
讲解程序前，我们先来了解一下 cppbuild.sh 这个文件，这个脚本在根目录下面，它主要
功能是被用来构建和创建本地 C++库。例如清单 8 所示，我们编译ffmpeg 库，
</p>

<p>
清单 8. 编译 ffmpeg 库
</p>

<pre class="example">
./cppbuild.sh -platform linux-x86_64 install ffmpeg

</pre>

<p>
脚本的第一个参数是-platform，值是 linux-x86&lt;sub&gt;64&lt;/sub&gt; 判断代码如清单 9 所示，
如果第一个参数是-platform，那么初始化变量 PLATFORM，然后参数位移动一位到第二个参
数，如果第二个参数是 install，那么初始化变量 OPERATION 为install，如果第二个参数
是 clean，初始化变量 OPERATION 为 clean。这里是install。
</p>

<p>
清单 9. 判断平台
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">while</span> [[ $<span style="font-weight: bold; font-style: italic;">#</span> &gt; 0 ]]; <span style="font-weight: bold;">do</span>
 <span style="font-weight: bold;">case</span> <span style="font-style: italic;">"$1"</span><span style="font-weight: bold;"> in</span>
 -platform)
 <span style="font-weight: bold;">shift</span>
 <span style="font-weight: bold; font-style: italic;">PLATFORM</span>=<span style="font-style: italic;">"$1"</span>
 ;;
 install)
 <span style="font-weight: bold; font-style: italic;">OPERATION</span>=install
 ;;
 clean)
 <span style="font-weight: bold; font-style: italic;">OPERATION</span>=clean
 ;;
 *)
 <span style="font-weight: bold; font-style: italic;">PROJECTS</span>+=(<span style="font-style: italic;">"$1"</span>)
 ;;
 <span style="font-weight: bold;">esac</span>
 <span style="font-weight: bold;">shift</span>
<span style="font-weight: bold;">done</span>

</pre>
</div>

<p>
确定了需要 install 操作后，程序进入实际执行阶段，如清单 10 所示。
</p>

<p>
清单 10. install 执行阶段
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">case</span> $<span style="font-weight: bold; font-style: italic;">OPERATION</span><span style="font-weight: bold;"> in</span>
 install)
 <span style="font-weight: bold;">if</span> [[ ! -d $<span style="font-weight: bold; font-style: italic;">PROJECT</span> ]]; <span style="font-weight: bold;">then</span>
 <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Warning: Project \"$PROJECT\" not found"</span>
 <span style="font-weight: bold;">else</span>
 <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Installing \"$PROJECT\""</span>
 mkdir -p $<span style="font-weight: bold; font-style: italic;">PROJECT</span>/cppbuild
 <span style="font-weight: bold;">pushd</span> $<span style="font-weight: bold; font-style: italic;">PROJECT</span>/cppbuild
 <span style="font-weight: bold;">source</span> ../cppbuild.sh
 <span style="font-weight: bold;">popd</span>
 <span style="font-weight: bold;">fi</span>

</pre>
</div>

<p>
清单 10 所示代码，创建 ffmpeg/cpubuild 目录，接下来将目录压入目录栈，在当前 bash
环境下读取并执行 ffmpeg 目录下的 cpubuild.sh 中的命令，最后将目录弹出目录栈。从
这里可以看出，真实执行的是 ffmpeg 目录下面的cpubuild.s h 命令，它的代码在这里不
做展开，主要执行的是一连串的 make命令，编译 C++代码、生成.so 文件。
</p>

<p>
示例程序 1：自己写一个简单的 FFmpeg 库
</p>

<p>
我们这里所举例的例子是一个调用 FFmpeg 多媒体库的示例。FFmpeg 是一套可以用来记录、
转换数字音频、视频，并能将其转化为流的开源计算机程序。采用LG PL 或 GPL 许可证。
它提供了录制、转换以及流化音视频的完整解决方案。
</p>

<p>
如果想要下载 FFmpeg 源代码或者库文件，可以在这里查找：<a href="http://ffmpeg.org/">http://ffmpeg.org/</a>。
</p>

<p>
如果想要查看 FFmpeg 的 API，可以在这里查找：
<a href="http://bytedeco.org/javacpp-presets/ffmpeg/apidocs/">http://bytedeco.org/javacpp-presets/ffmpeg/apidocs/</a>。
</p>

<p>
运行整个程序，我们需要三个文件，大家把这三个文件放在同一个目录下面。首先是 C 的
源代码，这里只引用一小部分，剩余的可以到 github 上看，作者是 Stephen Dranger。
</p>

<p>
清单 11. C 源代码
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="font-weight: bold; font-style: italic;">//</span>
<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">This tutorial was written by Stephen Dranger (dranger@gmail.com).</span>
<span style="font-weight: bold; font-style: italic;">//</span>
<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Code based on a tutorial by Martin Bohme (boehme@inb.uni-luebeckREMOVETHIS.de)</span>
<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Tested on Gentoo, CVS version 5/01/07 compiled with GCC 4.1.1</span>

<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">A small sample program that shows how to use libavformat and libavcodec to</span>
<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">read video from a file.</span>
<span style="font-weight: bold; font-style: italic;">//</span>
<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Use the Makefile to build all examples.</span>
<span style="font-weight: bold; font-style: italic;">//</span>
<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Run using</span>
<span style="font-weight: bold; font-style: italic;">//</span>
<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">tutorial01 myvideofile.mpg</span>
<span style="font-weight: bold; font-style: italic;">//</span>
<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">to write the first five frames from "myvideofile.mpg" to disk in PPM</span>
<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">format.</span>

<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;libavcodec/avcodec.h&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;libavformat/avformat.h&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;libswscale/swscale.h&gt;</span>

<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdio.h&gt;</span>

<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">SaveFrame</span>(<span style="font-weight: bold; text-decoration: underline;">AVFrame</span> *<span style="font-weight: bold; font-style: italic;">pFrame</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">width</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">height</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">iFrame</span>) {
<span style="font-weight: bold; text-decoration: underline;">FILE</span> *<span style="font-weight: bold; font-style: italic;">pFile</span>;
<span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">szFilename</span>[32];
<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">y</span>;

<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Open file</span>
sprintf(szFilename, <span style="font-style: italic;">"frame%d.ppm"</span>, iFrame);
pFile=fopen(szFilename, <span style="font-style: italic;">"wb"</span>);
<span style="font-weight: bold;">if</span>(pFile==<span style="font-weight: bold; text-decoration: underline;">NULL</span>)
<span style="font-weight: bold;">return</span>;

<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Write header</span>
fprintf(pFile, <span style="font-style: italic;">"P6\n%d %d\n255\n"</span>, width, height);

<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Write pixel data</span>
<span style="font-weight: bold;">for</span>(y=0; y&lt;height; y++)
fwrite(pFrame-&gt;data[0]+y*pFrame-&gt;linesize[0], 1, width*3, pFile);

<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Close file</span>
fclose(pFile);
}

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">argc</span>, <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">argv</span>[]) {
<span style="font-weight: bold; text-decoration: underline;">AVFormatContext</span> *<span style="font-weight: bold; font-style: italic;">pFormatCtx</span> = <span style="font-weight: bold; text-decoration: underline;">NULL</span>;
<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>, <span style="font-weight: bold; font-style: italic;">videoStream</span>;
<span style="font-weight: bold; text-decoration: underline;">AVCodecContext</span> *<span style="font-weight: bold; font-style: italic;">pCodecCtx</span> = <span style="font-weight: bold; text-decoration: underline;">NULL</span>;
<span style="font-weight: bold; text-decoration: underline;">AVCodec</span> *<span style="font-weight: bold; font-style: italic;">pCodec</span> = <span style="font-weight: bold; text-decoration: underline;">NULL</span>;
<span style="font-weight: bold; text-decoration: underline;">AVFrame</span> *<span style="font-weight: bold; font-style: italic;">pFrame</span> = <span style="font-weight: bold; text-decoration: underline;">NULL</span>;
<span style="font-weight: bold; text-decoration: underline;">AVFrame</span> *<span style="font-weight: bold; font-style: italic;">pFrameRGB</span> = <span style="font-weight: bold; text-decoration: underline;">NULL</span>;
<span style="font-weight: bold; text-decoration: underline;">AVPacket</span> <span style="font-weight: bold; font-style: italic;">packet</span>;
<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">frameFinished</span>;
<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">numBytes</span>;
<span style="font-weight: bold; text-decoration: underline;">uint8_t</span> *<span style="font-weight: bold; font-style: italic;">buffer</span> = <span style="font-weight: bold; text-decoration: underline;">NULL</span>;

<span style="font-weight: bold; text-decoration: underline;">AVDictionary</span> *<span style="font-weight: bold; font-style: italic;">optionsDict</span> = <span style="font-weight: bold; text-decoration: underline;">NULL</span>;
<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">SwsContext</span> *<span style="font-weight: bold; font-style: italic;">sws_ctx</span> = <span style="font-weight: bold; text-decoration: underline;">NULL</span>;

</pre>
</div>

<p>
接下来，需要创建一个 pom.xml 文件，这样可以利用 Maven 仓库下载我们需要的FFmpeg
 库文件。pom.xml 文件内容如清单 12 所示。
</p>

<p>
清单 12. pom.xml 文件
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="font-weight: bold;">project</span>&gt;
 &lt;<span style="font-weight: bold;">modelVersion</span>&gt;4.0.0&lt;/<span style="font-weight: bold;">modelVersion</span>&gt;
 &lt;<span style="font-weight: bold;">groupId</span>&gt;org.bytedeco.javacpp-presets.ffmpeg&lt;/<span style="font-weight: bold;">groupId</span>&gt;
 &lt;<span style="font-weight: bold;">artifactId</span>&gt;tutorial01&lt;/<span style="font-weight: bold;">artifactId</span>&gt;
 &lt;<span style="font-weight: bold;">version</span>&gt;1.0&lt;/<span style="font-weight: bold;">version</span>&gt;
 &lt;<span style="font-weight: bold;">dependencies</span>&gt;
 &lt;<span style="font-weight: bold;">dependency</span>&gt;
 &lt;<span style="font-weight: bold;">groupId</span>&gt;org.bytedeco.javacpp-presets&lt;/<span style="font-weight: bold;">groupId</span>&gt;
 &lt;<span style="font-weight: bold;">artifactId</span>&gt;ffmpeg&lt;/<span style="font-weight: bold;">artifactId</span>&gt;
 &lt;<span style="font-weight: bold;">version</span>&gt;2.7.1-1.0&lt;/<span style="font-weight: bold;">version</span>&gt;
 &lt;/<span style="font-weight: bold;">dependency</span>&gt;
 &lt;/<span style="font-weight: bold;">dependencies</span>&gt;
&lt;/<span style="font-weight: bold;">project</span>&gt;

</pre>
</div>

<p>
最后是 Java 代码的实现，在这个 Java 代码里面，它会调用 FFmpeg 的库函数进行针对视
频的转换，如清单 13 所示。
</p>

<p>
清单 13. Java 文件源代码
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">java</span>.<span style="font-weight: bold; text-decoration: underline;">io</span>.*;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">org</span>.<span style="font-weight: bold; text-decoration: underline;">bytedeco</span>.<span style="font-weight: bold; text-decoration: underline;">javacpp</span>.*;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">org</span>.<span style="font-weight: bold; text-decoration: underline;">bytedeco</span>.<span style="font-weight: bold; text-decoration: underline;">javacpp</span>.<span style="font-weight: bold; text-decoration: underline;">avcodec</span>.*;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">org</span>.<span style="font-weight: bold; text-decoration: underline;">bytedeco</span>.<span style="font-weight: bold; text-decoration: underline;">javacpp</span>.<span style="font-weight: bold; text-decoration: underline;">avformat</span>.*;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">org</span>.<span style="font-weight: bold; text-decoration: underline;">bytedeco</span>.<span style="font-weight: bold; text-decoration: underline;">javacpp</span>.<span style="font-weight: bold; text-decoration: underline;">avutil</span>.*;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">org</span>.<span style="font-weight: bold; text-decoration: underline;">bytedeco</span>.<span style="font-weight: bold; text-decoration: underline;">javacpp</span>.<span style="font-weight: bold; text-decoration: underline;">swscale</span>.*;

<span style="font-weight: bold;">public</span> <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">testJavaCPP</span> {
    <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">SaveFrame</span>(<span style="font-weight: bold; text-decoration: underline;">AVFrame</span> <span style="font-weight: bold; font-style: italic;">pFrame</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">width</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">height</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">iFrame</span>)
        <span style="font-weight: bold;">throws</span> <span style="font-weight: bold; text-decoration: underline;">IOException</span> {
        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Open file</span>
        <span style="font-weight: bold; text-decoration: underline;">OutputStream</span> <span style="font-weight: bold; font-style: italic;">stream</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">FileOutputStream</span>(<span style="font-style: italic;">"frame"</span> + iFrame + <span style="font-style: italic;">".ppm"</span>);

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Write header</span>
        stream.write((<span style="font-style: italic;">"P6\n"</span> + width + <span style="font-style: italic;">" "</span> + height + <span style="font-style: italic;">"\n255\n"</span>).getBytes());

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Write pixel data</span>
        <span style="font-weight: bold; text-decoration: underline;">BytePointer</span> <span style="font-weight: bold; font-style: italic;">data</span> = pFrame.data(0);
        <span style="font-weight: bold; text-decoration: underline;">byte</span>[] <span style="font-weight: bold; font-style: italic;">bytes</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">byte</span>[width * 3];
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">l</span> = pFrame.linesize(0);
        <span style="font-weight: bold;">for</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">y</span> = 0; y &lt; <span style="font-weight: bold; text-decoration: underline;">height</span>; y++) {
            data.position(y * l).get(bytes);
            stream.write(bytes);
        }

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Close file</span>
        stream.close();
    }

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">String</span>[] <span style="font-weight: bold; font-style: italic;">args</span>) <span style="font-weight: bold;">throws</span> <span style="font-weight: bold; text-decoration: underline;">IOException</span> {
        <span style="font-weight: bold; text-decoration: underline;">AVFormatContext</span> <span style="font-weight: bold; font-style: italic;">pFormatCtx</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">AVFormatContext</span>(<span style="font-weight: bold; text-decoration: underline;">null</span>);
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>, <span style="font-weight: bold; font-style: italic;">videoStream</span>;
        <span style="font-weight: bold; text-decoration: underline;">AVCodecContext</span> <span style="font-weight: bold; font-style: italic;">pCodecCtx</span> = <span style="font-weight: bold; text-decoration: underline;">null</span>;
        <span style="font-weight: bold; text-decoration: underline;">AVCodec</span> <span style="font-weight: bold; font-style: italic;">pCodec</span> = <span style="font-weight: bold; text-decoration: underline;">null</span>;
        <span style="font-weight: bold; text-decoration: underline;">AVFrame</span> <span style="font-weight: bold; font-style: italic;">pFrame</span> = <span style="font-weight: bold; text-decoration: underline;">null</span>;
        <span style="font-weight: bold; text-decoration: underline;">AVFrame</span> <span style="font-weight: bold; font-style: italic;">pFrameRGB</span> = <span style="font-weight: bold; text-decoration: underline;">null</span>;
        <span style="font-weight: bold; text-decoration: underline;">AVPacket</span> <span style="font-weight: bold; font-style: italic;">packet</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">AVPacket</span>();
        <span style="font-weight: bold; text-decoration: underline;">int</span>[] <span style="font-weight: bold; font-style: italic;">frameFinished</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">int</span>[1];
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">numBytes</span>;
        <span style="font-weight: bold; text-decoration: underline;">BytePointer</span> <span style="font-weight: bold; font-style: italic;">buffer</span> = <span style="font-weight: bold; text-decoration: underline;">null</span>;

        <span style="font-weight: bold; text-decoration: underline;">AVDictionary</span> <span style="font-weight: bold; font-style: italic;">optionsDict</span> = <span style="font-weight: bold; text-decoration: underline;">null</span>;
        <span style="font-weight: bold; text-decoration: underline;">SwsContext</span> <span style="font-weight: bold; font-style: italic;">sws_ctx</span> = <span style="font-weight: bold; text-decoration: underline;">null</span>;

        <span style="font-weight: bold;">if</span> (args.length &lt; 1) {
            System.out.println(<span style="font-style: italic;">"Please provide a movie file"</span>);
            System.exit(-1);
        }
        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Register all formats and codecs</span>
        av_register_all();

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Open video file</span>
        <span style="font-weight: bold;">if</span> (avformat_open_input(pFormatCtx, args[0], <span style="font-weight: bold; text-decoration: underline;">null</span>, <span style="font-weight: bold; text-decoration: underline;">null</span>) != 0) {
            System.exit(-1); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Couldn't open file</span>
        }

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Retrieve stream information</span>
        <span style="font-weight: bold;">if</span> (avformat_find_stream_info(pFormatCtx, (PointerPointer)<span style="font-weight: bold; text-decoration: underline;">null</span>) &lt; 0) {
            System.exit(-1); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Couldn't find stream information</span>
        }

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Dump information about file onto standard error</span>
        av_dump_format(pFormatCtx, 0, args[0], 0);

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Find the first video stream</span>
        videoStream = -1;
        <span style="font-weight: bold;">for</span> (i = 0; i &lt; pFormatCtx.<span style="font-weight: bold; text-decoration: underline;">nb_streams</span>(); i++) {
            <span style="font-weight: bold;">if</span> (pFormatCtx.streams(i).codec().codec_type() == AVMEDIA_TYPE_VIDEO) {
                videoStream = i;
                <span style="font-weight: bold;">break</span>;
            }
        }
        <span style="font-weight: bold;">if</span> (videoStream == -1) {
            System.exit(-1); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Didn't find a video stream</span>
        }

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Get a pointer to the codec context for the video stream</span>
        pCodecCtx = pFormatCtx.streams(videoStream).codec();

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Find the decoder for the video stream</span>
        pCodec = avcodec_find_decoder(pCodecCtx.codec_id());
        <span style="font-weight: bold;">if</span> (pCodec == <span style="font-weight: bold; text-decoration: underline;">null</span>) {
            System.err.println(<span style="font-style: italic;">"Unsupported codec!"</span>);
            System.exit(-1); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Codec not found</span>
        }
        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Open codec</span>
        <span style="font-weight: bold;">if</span> (avcodec_open2(pCodecCtx, pCodec, optionsDict) &lt; 0) {
            System.exit(-1); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Could not open codec</span>
        }

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Allocate video frame</span>
        pFrame = av_frame_alloc();

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Allocate an AVFrame structure</span>
        pFrameRGB = av_frame_alloc();
        <span style="font-weight: bold;">if</span>(pFrameRGB == <span style="font-weight: bold; text-decoration: underline;">null</span>) {
            System.exit(-1);
        }

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Determine required buffer size and allocate buffer</span>
        numBytes = avpicture_get_size(AV_PIX_FMT_RGB24,
                                      pCodecCtx.width(), pCodecCtx.height());
        buffer = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BytePointer</span>(av_malloc(numBytes));

        sws_ctx = sws_getContext(pCodecCtx.width(), pCodecCtx.height(),
                                 pCodecCtx.pix_fmt(), pCodecCtx.width(), pCodecCtx.height(),
                                 AV_PIX_FMT_RGB24, SWS_BILINEAR, <span style="font-weight: bold; text-decoration: underline;">null</span>, <span style="font-weight: bold; text-decoration: underline;">null</span>, (DoublePointer)<span style="font-weight: bold; text-decoration: underline;">null</span>);

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Assign appropriate parts of buffer to image planes in pFrameRGB</span>
        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Note that pFrameRGB is an AVFrame, but AVFrame is a superset</span>
        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">of AVPicture</span>
        avpicture_fill(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">AVPicture</span>(pFrameRGB), buffer, AV_PIX_FMT_RGB24,
                       pCodecCtx.width(), pCodecCtx.height());

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Read frames and save first five frames to disk</span>
        i = 0;
        <span style="font-weight: bold;">while</span> (av_read_frame(pFormatCtx, packet) &gt;= 0) {
            <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Is this a packet from the video stream?</span>
            <span style="font-weight: bold;">if</span> (packet.stream_index() == videoStream) {
                <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Decode video frame</span>
                avcodec_decode_video2(pCodecCtx, pFrame, frameFinished, packet);

                <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Did we get a video frame?</span>
                <span style="font-weight: bold;">if</span> (frameFinished[0] != 0) {
                    <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Convert the image from its native format to RGB</span>
                    sws_scale(sws_ctx, pFrame.data(), pFrame.linesize(), 0,
                              pCodecCtx.height(), pFrameRGB.data(), pFrameRGB.linesize());

                    <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Save the frame to disk</span>
                    <span style="font-weight: bold;">if</span> (++i&lt;=5) {
                        SaveFrame(pFrameRGB, pCodecCtx.width(), pCodecCtx.height(), i);
                    }
                }
            }

            <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Free the packet that was allocated by av_read_frame</span>
            av_free_packet(packet);
        }

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Free the RGB image</span>
        av_free(buffer);
        av_free(pFrameRGB);

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Free the YUV frame</span>
        av_free(pFrame);

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Close the codec</span>
        avcodec_close(pCodecCtx);

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Close the video file</span>
        avformat_close_input(pFormatCtx);

        System.exit(0);
    }

</pre>
</div>

<p>
所需要的文件创建完毕以后，可以通过 maven 命令来编译、执行程序，如清单 14 所示。
</p>

<p>
清单 14. 运行命令
</p>

<pre class="example">
mvn package exec:java -Dexec.mainClass=testJavaCPP -Dexec.args="您的视频文件"

</pre>

<p>
示例程序 2：加入一个新的库
</p>

<p>
从清单 10 我们知道，最终调用的是自己 C++代码文件夹里面的 cppbuild.sh文件，所以我
们如果想要增加一个新的库，势必也需要创建该文件。总的来说，我们需要注意三点：
</p>

<ol class="org-ol">
<li>创建一个全部小写字母组成的文件夹，这个文件夹的名称和最终生成的JAR 包的文件名，
以及 Maven 的 attifact 名称会完全一致，例如 test c++；</li>
<li>在这个文件夹下，创建新的工程，这个工程需要包括 cppbuild.sh 文件和pom.xml 文件，
以及属于 org.bytedeco.javacpp.presets 包的 Java 的配置文件；</li>
<li>上述 2 步到位后，发起一个请求，编译自己的代码，然后上传二进制库文件到 Maven
中央仓库，这样其他用户也可以调用您的库实现本地方法操作了。 我们以
java.util.zip 包为例，里面包含了一个 zlib 库，首先需要创建 cppbuild.s h，代码
里面需要下载 zlib 源代码，如清单 15 所示。</li>
</ol>

<p>
清单 15. zlib 的 cppbuild.sh 文件源代码
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">bash</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">This file is meant to be included by the parent cppbuild.sh script</span>
<span style="font-weight: bold;">if</span> [[ -z <span style="font-style: italic;">"$PLATFORM"</span> ]]; <span style="font-weight: bold;">then</span>
 <span style="font-weight: bold;">pushd</span> ..
 bash cppbuild.sh <span style="font-style: italic;">"$@"</span> zlib
 <span style="font-weight: bold;">popd</span>
 <span style="font-weight: bold;">exit</span>
<span style="font-weight: bold;">fi</span>

<span style="font-weight: bold;">if</span> [[ $<span style="font-weight: bold; font-style: italic;">PLATFORM</span> == windows* ]]; <span style="font-weight: bold;">then</span>
 <span style="font-weight: bold; font-style: italic;">ZLIB_VERSION</span>=128
 download http://zlib.net/zlib$<span style="font-weight: bold; font-style: italic;">ZLIB_VERSION</span>-dll.zip zlib$<span style="font-weight: bold; font-style: italic;">ZLIB_VERSION</span>-dll.zip
 mkdir -p $<span style="font-weight: bold; font-style: italic;">PLATFORM</span>
 <span style="font-weight: bold;">cd</span> $<span style="font-weight: bold; font-style: italic;">PLATFORM</span>
 unzip ../zlib$<span style="font-weight: bold; font-style: italic;">ZLIB_VERSION</span>-dll.zip -d zlib$<span style="font-weight: bold; font-style: italic;">ZLIB_VERSION</span>-dll
 <span style="font-weight: bold;">cd</span> zlib$<span style="font-weight: bold; font-style: italic;">ZLIB_VERSION</span>-dll
<span style="font-weight: bold;">else</span>
 <span style="font-weight: bold; font-style: italic;">ZLIB_VERSION</span>=1.2.8
 download http://zlib.net/zlib-$<span style="font-weight: bold; font-style: italic;">ZLIB_VERSION</span>.tar.gz zlib-$<span style="font-weight: bold; font-style: italic;">ZLIB_VERSION</span>.tar.gz
 mkdir -p $<span style="font-weight: bold; font-style: italic;">PLATFORM</span>
 <span style="font-weight: bold;">cd</span> $<span style="font-weight: bold; font-style: italic;">PLATFORM</span>
 tar -xzvf ../zlib-$<span style="font-weight: bold; font-style: italic;">ZLIB_VERSION</span>.tar.gz
 <span style="font-weight: bold;">cd</span> zlib-$<span style="font-weight: bold; font-style: italic;">ZLIB_VERSION</span>
<span style="font-weight: bold;">fi</span>

<span style="font-weight: bold;">case</span> $<span style="font-weight: bold; font-style: italic;">PLATFORM</span><span style="font-weight: bold;"> in</span>
 linux-x86)
 <span style="font-weight: bold; font-style: italic;">CC</span>=<span style="font-style: italic;">"gcc -m32 -fPIC"</span> ./configure --prefix=.. --static
 make -j4
 make install
 ;;
 *)
 <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"Error: Platform \"$PLATFORM\" is not supported"</span>
 ;;
<span style="font-weight: bold;">esac</span>

<span style="font-weight: bold;">cd</span> ../..
</pre>
</div>

<p>
pom.xml 如清单 16 所示，最终生成 zlib 的 jar 包。
</p>

<p>
清单 16. zlib 的 pom.xml 源代码
</p>
<div class="org-src-container">
<pre class="src src-xml"><span style="font-style: italic;">&lt;?</span><span style="font-weight: bold; font-style: italic;">xml</span><span style="font-style: italic;"> </span><span style="font-style: italic;">version="1.0" encoding="UTF-8"</span><span style="font-style: italic;">?&gt;</span>
&lt;<span style="font-weight: bold;">project</span> <span style="font-weight: bold;">xmlns</span>=<span style="font-style: italic;">"http://maven.apache.org/POM/4.0.0"</span> <span style="font-weight: bold;">xmlns</span>:<span style="font-weight: bold; font-style: italic;">xsi</span>=<span style="font-style: italic;">"http://www.w3.org/2001/XMLSchema-instance"</span>
 <span style="font-weight: bold;">xsi</span>:<span style="font-weight: bold; font-style: italic;">schemaLocation</span>=<span style="font-style: italic;">"http://maven.apache.org/POM/4.0.0 http://maven.apache.org/maven-v4_0_0.xsd"</span>&gt;
 &lt;<span style="font-weight: bold;">modelVersion</span>&gt;4.0.0&lt;/<span style="font-weight: bold;">modelVersion</span>&gt;

 &lt;<span style="font-weight: bold;">parent</span>&gt;
 &lt;<span style="font-weight: bold;">groupId</span>&gt;org.bytedeco&lt;/<span style="font-weight: bold;">groupId</span>&gt;
 &lt;<span style="font-weight: bold;">artifactId</span>&gt;javacpp-presets&lt;/<span style="font-weight: bold;">artifactId</span>&gt;
 &lt;<span style="font-weight: bold;">version</span>&gt;0.10&lt;/<span style="font-weight: bold;">version</span>&gt;
 &lt;/<span style="font-weight: bold;">parent</span>&gt;

 &lt;<span style="font-weight: bold;">groupId</span>&gt;org.bytedeco.javacpp-presets&lt;/<span style="font-weight: bold;">groupId</span>&gt;
 &lt;<span style="font-weight: bold;">artifactId</span>&gt;zlib&lt;/<span style="font-weight: bold;">artifactId</span>&gt;
 &lt;<span style="font-weight: bold;">version</span>&gt;1.2.8-${project.parent.version}&lt;/<span style="font-weight: bold;">version</span>&gt;
 &lt;<span style="font-weight: bold;">packaging</span>&gt;jar&lt;/<span style="font-weight: bold;">packaging</span>&gt;
 &lt;<span style="font-weight: bold;">name</span>&gt;JavaCPP Presets for zlib&lt;/<span style="font-weight: bold;">name</span>&gt;

 &lt;<span style="font-weight: bold;">dependencies</span>&gt;
 &lt;<span style="font-weight: bold;">dependency</span>&gt;
 &lt;<span style="font-weight: bold;">groupId</span>&gt;org.bytedeco&lt;/<span style="font-weight: bold;">groupId</span>&gt;
 &lt;<span style="font-weight: bold;">artifactId</span>&gt;javacpp&lt;/<span style="font-weight: bold;">artifactId</span>&gt;
 &lt;/<span style="font-weight: bold;">dependency</span>&gt;
 &lt;/<span style="font-weight: bold;">dependencies</span>&gt;

 &lt;<span style="font-weight: bold;">build</span>&gt;
 &lt;<span style="font-weight: bold;">plugins</span>&gt;
 &lt;<span style="font-weight: bold;">plugin</span>&gt;
 &lt;<span style="font-weight: bold;">artifactId</span>&gt;maven-resources-plugin&lt;/<span style="font-weight: bold;">artifactId</span>&gt;
 &lt;/<span style="font-weight: bold;">plugin</span>&gt;
 &lt;<span style="font-weight: bold;">plugin</span>&gt;
 &lt;<span style="font-weight: bold;">artifactId</span>&gt;maven-compiler-plugin&lt;/<span style="font-weight: bold;">artifactId</span>&gt;
 &lt;/<span style="font-weight: bold;">plugin</span>&gt;
 &lt;<span style="font-weight: bold;">plugin</span>&gt;
 &lt;<span style="font-weight: bold;">groupId</span>&gt;org.bytedeco&lt;/<span style="font-weight: bold;">groupId</span>&gt;
 &lt;<span style="font-weight: bold;">artifactId</span>&gt;javacpp&lt;/<span style="font-weight: bold;">artifactId</span>&gt;
 &lt;/<span style="font-weight: bold;">plugin</span>&gt;
 &lt;<span style="font-weight: bold;">plugin</span>&gt;
 &lt;<span style="font-weight: bold;">artifactId</span>&gt;maven-jar-plugin&lt;/<span style="font-weight: bold;">artifactId</span>&gt;
 &lt;/<span style="font-weight: bold;">plugin</span>&gt;
 &lt;<span style="font-weight: bold;">plugin</span>&gt;
 &lt;<span style="font-weight: bold;">artifactId</span>&gt;maven-dependency-plugin&lt;/<span style="font-weight: bold;">artifactId</span>&gt;
 &lt;/<span style="font-weight: bold;">plugin</span>&gt;
 &lt;<span style="font-weight: bold;">plugin</span>&gt;
 &lt;<span style="font-weight: bold;">artifactId</span>&gt;maven-source-plugin&lt;/<span style="font-weight: bold;">artifactId</span>&gt;
 &lt;/<span style="font-weight: bold;">plugin</span>&gt;
 &lt;<span style="font-weight: bold;">plugin</span>&gt;
 &lt;<span style="font-weight: bold;">artifactId</span>&gt;maven-javadoc-plugin&lt;/<span style="font-weight: bold;">artifactId</span>&gt;
 &lt;/<span style="font-weight: bold;">plugin</span>&gt;
 &lt;/<span style="font-weight: bold;">plugins</span>&gt;
 &lt;/<span style="font-weight: bold;">build</span>&gt;

&lt;/<span style="font-weight: bold;">project</span>&gt;

</pre>
</div>

<p>
清单 17 所示是 Java 配置文件，文件需要被放在
src/main/java/org/bytedeco/javacpp/presets 目录下面。
</p>

<p>
清单 17. zlib 的 Java 源代码
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold;">package</span> org.bytedeco.javacpp.<span style="font-weight: bold; text-decoration: underline;">presets</span>;

<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">org</span>.<span style="font-weight: bold; text-decoration: underline;">bytedeco</span>.<span style="font-weight: bold; text-decoration: underline;">javacpp</span>.<span style="font-weight: bold; text-decoration: underline;">annotation</span>.*;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">org</span>.<span style="font-weight: bold; text-decoration: underline;">bytedeco</span>.<span style="font-weight: bold; text-decoration: underline;">javacpp</span>.<span style="font-weight: bold; text-decoration: underline;">tools</span>.*;

<span style="font-weight: bold; text-decoration: underline;">@Properties</span>(target=<span style="font-style: italic;">"org.bytedeco.javacpp.zlib"</span>, value={
                                 <span style="font-weight: bold; text-decoration: underline;">@Platform</span>(include=<span style="font-style: italic;">"&lt;zlib.h&gt;"</span>, link=<span style="font-style: italic;">"z@.1"</span>),
 <span style="font-weight: bold; text-decoration: underline;">@Platform</span>(value=<span style="font-style: italic;">"windows"</span>, link=<span style="font-style: italic;">"zdll"</span>, preload=<span style="font-style: italic;">"zlib1"</span>)})
<span style="font-weight: bold;">public</span> <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">zlib</span> <span style="font-weight: bold;">implements</span> <span style="font-weight: bold; text-decoration: underline;">InfoMapper</span> {
 <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">map</span>(<span style="font-weight: bold; text-decoration: underline;">InfoMap</span> <span style="font-weight: bold; font-style: italic;">infoMap</span>) {
 infoMap.put(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Info</span>(<span style="font-style: italic;">"ZEXTERN"</span>, <span style="font-style: italic;">"ZEXPORT"</span>, <span style="font-style: italic;">"z_const"</span>, <span style="font-style: italic;">"zlib_version"</span>).cppTypes().annotations())
 .put(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Info</span>(<span style="font-style: italic;">"FAR"</span>).cppText(<span style="font-style: italic;">"#define FAR"</span>))
 .put(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Info</span>(<span style="font-style: italic;">"OF"</span>).cppText(<span style="font-style: italic;">"#define OF(args) args"</span>))
 .put(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Info</span>(<span style="font-style: italic;">"Z_ARG"</span>).cppText(<span style="font-style: italic;">"#define Z_ARG(args) args"</span>))
 .put(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Info</span>(<span style="font-style: italic;">"Byte"</span>, <span style="font-style: italic;">"Bytef"</span>, <span style="font-style: italic;">"charf"</span>).cast().valueTypes(<span style="font-style: italic;">"byte"</span>).pointerTypes(<span style="font-style: italic;">"BytePointer"</span>))
 .put(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Info</span>(<span style="font-style: italic;">"uInt"</span>, <span style="font-style: italic;">"uIntf"</span>).cast().valueTypes(<span style="font-style: italic;">"int"</span>).pointerTypes(<span style="font-style: italic;">"IntPointer"</span>))
 .put(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Info</span>(<span style="font-style: italic;">"uLong"</span>, <span style="font-style: italic;">"uLongf"</span>, <span style="font-style: italic;">"z_crc_t"</span>, <span style="font-style: italic;">"z_off_t"</span>).cast().valueTypes(
                                    <span style="font-style: italic;">"long"</span>).pointerTypes(<span style="font-style: italic;">"CLongPointer"</span>))
 .put(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Info</span>(<span style="font-style: italic;">"z_off64_t"</span>).cast().valueTypes(<span style="font-style: italic;">"long"</span>).pointerTypes(<span style="font-style: italic;">"LongPointer"</span>))
 .put(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Info</span>(<span style="font-style: italic;">"voidp"</span>, <span style="font-style: italic;">"voidpc"</span>, <span style="font-style: italic;">"voidpf"</span>).valueTypes(<span style="font-style: italic;">"Pointer"</span>))
 .put(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Info</span>(<span style="font-style: italic;">"gzFile_s"</span>).pointerTypes(<span style="font-style: italic;">"gzFile"</span>))
 .put(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Info</span>(<span style="font-style: italic;">"gzFile"</span>).valueTypes(<span style="font-style: italic;">"gzFile"</span>))
 .put(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Info</span>(<span style="font-style: italic;">"Z_LARGE64"</span>, <span style="font-style: italic;">"!defined(ZLIB_INTERNAL) &amp;&amp; defined(Z_WANT64)"</span>).define(<span style="font-weight: bold; text-decoration: underline;">false</span>))
 .put(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Info</span>(<span style="font-style: italic;">"inflateGetDictionary"</span>, <span style="font-style: italic;">"gzopen_w"</span>, <span style="font-style: italic;">"gzvprintf"</span>).skip());
 }
}

</pre>
</div>

<p>
在我们的父目录 javacpp-presets 里面，我们需要把 zlib 这个模块的名称加入到
pom.xml 的模块列表里面，这样我们就可以像前面示例代码一样运行程序来生成.so 包和
jar 包，mvn install –projects zlib。
</p>
</div>
</div>
