wiki/2016-07-01-java-JavaCPP.html

<div id="outline-container-org03d74b0" class="outline-2">
<h2 id="org03d74b0">JavaCPP 性能测试</h2>
<div class="outline-text-2" id="text-org03d74b0">
<p>
通过上面实验的实现，我们掌握了如何使用 JavaCpp，现在我们开始尝试针对JavaCpp 的测
试。我们这个实验基于一个人脸算法库，该人脸算法库具备检测、建模、比对功能，网上有
很多开源的人脸识别算法库，大家可以自行下载。当我们使用单线程时，本地预先加载人脸
特征值数据，分别使用 C++代码和 Java调用 JNI 库的方式，在内存中循环比对 1000 万次，
比对测试结果如表 2 所示。
</p>

<p>
表 2. JNI 库和 C++库单线程性能比较
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
  <colgroup>
    <col  class="org-left" />

    <col  class="org-right" />

    <col  class="org-right" />

    <col  class="org-right" />
  </colgroup>
  <tbody>
    <tr>
      <td class="org-left">方式</td>
      <td class="org-right">比对次数 (万次)</td>
      <td class="org-right">耗时/ms</td>
      <td class="org-right">比对速率/rps（records per second）</td>
    </tr>


    <tr>
      <td class="org-left">C++</td>
      <td class="org-right">1000</td>
      <td class="org-right">11055</td>
      <td class="org-right">904322</td>
    </tr>


    <tr>
      <td class="org-left">Java 调用 JNI 库</td>
      <td class="org-right">1000</td>
      <td class="org-right">14732</td>
      <td class="org-right">702592</td>
    </tr>


    <tr>
      <td class="org-left">Javacpp 调用算法库</td>
      <td class="org-right">1000</td>
      <td class="org-right">13066</td>
      <td class="org-right">765345</td>
    </tr>
  </tbody>
</table>

<p>
从上面的数据可以看出，直接用 C++调用算法库效率最高，其次是 JavaCPP 方式，JNI 方
式耗时最长。当然，这里没有列举的 JNA 技术，它的效率会更差。这些效率差距主要在底
层字节码的编译形式上的区别。表 2 的方式是单线程方式，我们采用多线程方式再来做一
次测试，测试结果如图 2 所示。我们可以看出，多线程环境下，C++和 JavaCPP 的优势更
加明显，整体效率系统接近0.95-1，JNI 方式的效率则平均在 0.81 左右。
</p>

<p>
图 2. JNI 库和 C++库多线程性能比较
</p>
</div>
</div>

<div id="outline-container-orgb7a562e" class="outline-2">
<h2 id="orgb7a562e">结束语</h2>
<div class="outline-text-2" id="text-orgb7a562e">
<p>
我们发现，采用 JavaCPP 方式在编程上较 JNI 方式简单很多，另外，效率也比JNI 高，所
以建议多采用 JavaCPP 技术。当然，如果是开源项目，也可以通过JavaCPP presets 子项
目来分享自己做的库文件，让其他人快速使用。最后，通过一个有针对性的性能测试案例，
读者也可以了解较 JNI 技术相比 JavaCPP 的优势所在。
</p>
</div>
</div>

<div id="outline-container-org47e3cb8" class="outline-2">
<h2 id="org47e3cb8">参考资料</h2>
<div class="outline-text-2" id="text-org47e3cb8">
<ul class="org-ul">
<li>参考网站 IBM 开发者论坛 这里发布了多篇关于 JNI 的文章。</li>
<li>参考文章 较详细的介绍 JNI 作者对于 JNI 技术的介绍较为深入、详细。</li>
<li>参考网站 FFMPEG 这里详细介绍了 JavaCpp Presets 对于 FFMPEG 库的封装实现方式。</li>
<li>参考网站 JavaCPP 这里是 JavaCPP 技术的分享地点。</li>
<li>参考网站 JavaCPP Presets 这里是 Presets 子项目的技术分享地点。</li>
<li>developerWorks Java 技术专区：这里有数百篇关于 Java 编程各个方面的文章。</li>
</ul>
</div>
</div>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
